using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public static class ScriptData
{
    public static string[] firstScript = {
        "안녕하신가.-오래간만이군.",
        "나, 천재 아티팩터 엘림스 스마일.-기억하지?-못 본 지 꽤 된 것 같은데.",
        "동화나라에 다시 온 이유...-별건 아니고. 연구하는 데 조수가 필요해서 말이야.",
        "보시다시피 가면 때문에-어딜 가든 누굴 보든-영 접근하기가 힘들단 말이지.-그래서 날 도와줄 사람이나 찾으러 왔는데...",
        "생각해보니 잘 됐군.-이렇게 된 거, 네가 나를 좀 도와야겠어.",
        "걱정 마.-보수는 아쉽지 않게 챙겨줄 테니.",
        "할 건 그리 많지 않아.-썸머 아일랜드의 띠루띠루 족, 기억하나?-그곳에 다시 가려고 해.",
        "가서 어떻게든 친해져서-'언어'와 관련된 자료를 모아 와.",
        "어떻게 하냐고? 별 거 없어.-띠루띠루 족이 하는 말을 그대로 따라 적어 오면-내 명석한 두뇌로 네 부실한 자료를-유의미하게 사용해주지.",
        "자, 자! 좋아.-앞으로 잘 좀 부탁할게.",
        "10장, 모아올 수 있겠지?-알다시피 그곳은 열대지방이야.-오래 있다가는 푹 익어올 테니 빠르게 다녀오라고.",
        "띠루띠루 족과 마주치면,-당황하지 말고 가만히 바라봐.-한, 5초 정도?",
        "그러면 공격 의사가 없다는 걸 알고-대화 정도는 할 수 있지 않나 싶은데.",
        "절대 날붙이 앞에서 흥분하지 마.-이상.-준비 되면 출발해."
    };

    public static string[] secondScript =
    {
        "아, 그걸 말을 안 했군.",
        "붉은 주민은 난폭해서-네가 별 짓 안 해도 쫓겨날 수 있어.-운이 안 좋으면...-꼬챙이에 꽂혀 돌아갈지도 모르겠군.",
        "그런 의미에서-늑장 부리지 말고 빠르게 빠르게.",
        "주민이 하는 말이 들릴만큼 다가가서-가만히 응시해.-간단하지?",
        "아니, 아니지. 잘못 말했어.-'보일'만큼 다가가서 가만히 바라봐.",
        "응?-말이 보인다는 게 무슨 의미냐고?",
        "큭큭... 묻지 마.-하지만 안심해.-엘림스 스마일은 거짓말하지 않으니까.",
        "그럼 행운을 빌지."
    };

    public static string[] currentAchivement = {
        "어디보자...",
        "지금까지 네가 가져온 메모지는 +장이야.",
        "지금까지 들은 단어는 총 _단어고,-그 중에서 제대로 받아적은 단어는 =개,-잘못 받아적은 단어는 @개.",
        "쫓겨나거나 실려나온 횟수는 `번이군.",
        "이게 궁금했나?"
    };

    public static string[] finished = {
        "오! 이정도면 충분할 것 같은데.",
        "지금까지 수고했어.-약속한 보상은 가능한 한 빠르게 보내도록 하지.",
        "넌 이제 자유야.-이렇게 말하니 억지로 시킨 느낌이 드는군...",
        "애초부터 네 조수 역할은-너의 자발적 지원이었으니 상관 없나?",
        "뭐, 좋아.-천재 아티팩터,-엘림스 스마일의 연구를 더 돕고 싶다면-그 성의는 사양 않고 받도록 하지.",
        "수고했다."
    };
}